Revit 2027 API
AreaReinforcement.GetNumberOfLines Method
 Gets the number of lines on the specified layer. It also counts the excluded ones.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfLines(
	AreaReinforcementLayerType layer
)
Public Function GetNumberOfLines (
	layer As AreaReinforcementLayerType
) As Integer
public:
int GetNumberOfLines(
	AreaReinforcementLayerType layer
)
member GetNumberOfLines :
        layer : AreaReinforcementLayerType -> int
Parameters
layer AreaReinforcementLayerType
 The layer type for which will return the number of lines.
Return Value
Int32
 Returns the number of lines on the specified layer.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InapplicableDataException |  The layer layer isn't active.
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace